# Напишите программу, которая будет выводить разные строки в зависимости
# от того, какое целое число было вами присвоено переменной age,
# содержащейся в этой программе.

age = 23

if age < 24:
    print("Меньше 24")
elif age == 24:
    print('Равно 24')
elif age > 24:
    print('Больше 24')
