# Напишите программу, которая принимает две переменные,
# делит одну на другую и выводит частное.

x = int(input('введите x: '))
y = int(input('введите y: '))

print("результат деления", x, "на", y, "равен:", x / y)
