# Напишите программу, которая выполняет деление двух чисел и выводит остаток.

x = int(input('введите x: '))
y = int(input('введите y: '))

print("остаток от деления", x, "на", y, "равен:", x % y)
